#include <wiringPi.h>
#include <softTone.h>

#define SPKR 	6 	/* GPIO25 */
#define TOTAL 	32 

// int notes[] = { 	/* 학교종을 연주하기 위한 계이름 */
// 	391, 391, 440, 440, 391, 391, 329.63, 329.63, \
// 	391, 391, 329.63, 329.63, 293.66, 293.66, 293.66, 0, \
// 	391, 391, 440, 440, 391, 391, 329.63, 329.63, \
// 	391, 329.63, 293.66, 329.63, 261.63, 261.63, 261.63, 0
// };

// 슈퍼 마리오
int notes[] = {
  660, 660, 0, 660, 0, 523, 660, 0,
  784, 0, 0, 0,
  392, 0, 0, 0,

  523, 0, 0, 392, 0, 0, 330, 0,
  0, 440, 0, 494, 0, 466, 440, 0,

  392, 660, 784, 880, 0,
  698, 784, 0,
  660, 0, 523, 587, 494, 0
};

int musicPlay( )
{
    int i;
    softToneCreate(SPKR); 	/* 톤 출력을 위한 GPIO 설정 */
    for (i = 0; i < TOTAL; ++i) {
        softToneWrite(SPKR, notes[i]); /* 톤 출력 : 학교종 연주 */
        delay(280); 		/* 음의 전체 길이만큼 출력되도록 대기 */
    }
    return 0;
}

int main( )
{
    wiringPiSetup( );
    musicPlay( ); 		/* 음악 연주를 위한 함수 호출 */
    return 0;
}
